Revit 2027 API
BuiltInFailures.ExtendedPropertiesLinkFailures.InvalidCategory Property
 The dataset contains an invalid category in the bindings of property definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidCategory { get; }
Public Shared ReadOnly Property InvalidCategory As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidCategory {
	FailureDefinitionId^ get ();
}
static member InvalidCategory : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtendedPropertiesLinkFailures Class
Autodesk.Revit.DB Namespace